app/Controllers/Configuracion.php

        public function index($activo = 1) {
            $nombre = $this->configuracion->where('nombre', 'tienda_nombre') -> first();
            $rfc = $this->configuracion->where('nombre', 'tienda_rfc') -> first();
            $direccion = $this->configuracion->where('nombre', 'tienda_direccion') -> first();
            $email = $this->configuracion->where('nombre', 'tienda_email') -> first();
            $telefono = $this->configuracion->where('nombre', 'tienda_telefono') -> first();
            $ticket = $this->configuracion->where('nombre', 'ticket') -> first();
---
SELECT *
FROM `configuracion`
WHERE `nombre` = 'tienda_nombre'
 LIMIT 1
SELECT *
FROM `configuracion`
WHERE `nombre` = 'tienda_rfc'
 LIMIT 1
SELECT *
FROM `configuracion`
WHERE `nombre` = 'tienda_direccion'
 LIMIT 1
SELECT *
FROM `configuracion`
WHERE `nombre` = 'tienda_email'
 LIMIT 1
SELECT *
FROM `configuracion`
WHERE `nombre` = 'tienda_telefono'
 LIMIT 1
SELECT *
FROM `configuracion`
WHERE `nombre` = 'ticket'
 LIMIT 1